[
  {
    "path": "blog_posts/2026-01-05-decisiones-difciles/",
    "title": "Decisiones Difíciles",
    "description": "A short description of the post.",
    "author": [
      {
        "name": "Erick García-García, Ph.D.",
        "url": {}
      }
    ],
    "date": "2026-01-06",
    "categories": [],
    "contents": "\n\nContents\nDecisiones difíciles\nAnálisis de grupos por k-medias\n\n\n\n\nDecisiones difíciles\nHELP International es una ONG humanitaria internacional que la lucha contra la pobreza y proporciona servicios básicos y socorro a la población de los países atrasados, especialmente frente a desastres naturales.\nHELP International recaudó alrededor de $10 millones USD y quiere utilizar ese dinero de forma estratégica para desarrollar campañas de ayuda en los países que más lo necesiten.\n¿Cómo decidimos qué países necesitan más ayuda?\nHELP International contaba con una tabla de datos sociodemográficos (descargar) de 167 países candidatos con las siguientes variables:\nPaís (country): Nombre del país.\nMortalidad infantil (child_mort): Muerte de niños menores de 5 años por cada 1.000 nacidos vivos\nExportaciones (export): Exportaciones de bienes y servicios per cápita. Dado el porcentaje del PIB per cápita\nSalud (health): gasto total en salud per cápita. Dado el porcentaje del PIB per cápita\nImportaciones (import): Importaciones de bienes y servicios per cápita. Dado el porcentaje del PIB per cápita\nIngresos (income): Ingresos netos por persona\nInflación (inflation): Inflación en relación al crecimiento anual del PIB total\nEsperanza de vida (life_expec): Promedio de años que viviría un niño recién nacido si los patrones actuales de mortalidad sigan siendo los mismos\nFertilidad (tot_fert): Número de hijos que nacería de cada mujer si las tasas actuales de fecundidad por edad siguen siendo las mismas.\nProducto interno bruto (gdpp): PIB per cápita. Calculado como el PIB total dividido por la población total.\nTabla 1. Países con el PIB más bajo (15 últimos).\n\ncountrygdppchild_mortexportshealthimportsincomeinflationlife_expectotal_ferBurundi23193.68.9211.6039.276412.3057.76.26Liberia32789.319.1011.8092.67005.4760.85.02Congo, Dem. Rep.334116.041.107.9149.660920.8057.56.54Niger348123.022.205.1649.18142.5558.87.49Sierra Leone399160.016.8013.1034.51,22017.2055.05.20Madagascar41362.225.003.7743.01,3908.7960.84.60Mozambique419101.031.505.2146.29187.6454.55.56Central African Republic446149.011.803.9826.58882.0147.55.21Malawi45990.522.806.5934.91,03012.1053.15.31Eritrea48255.24.792.6623.31,42011.6061.74.61Togo48890.340.207.6557.31,2101.1858.74.87Guinea-Bissau547114.014.908.5035.21,3902.9755.65.05Afghanistan55390.210.007.5844.91,6109.4456.25.82Gambia56280.323.805.6942.71,6604.3065.55.71Rwanda56363.612.0010.5030.01,3502.6164.64.51\n\nEl PIB podría ser un buen criterio de selección, así que lo primero que haremos será correlacionarlo con el resto de nuestras variables.\n\n\n\nFigura1. Correlación del PIB (gdpp) con las otras variables socioeconómicas.\nLa figura 1 muestra que el PIB tiene diferentes grados de correlación con el resto de las variables por lo que podría utilizarse como un criterio de selección, eligiendo simplemente los países con los valores más bajos.\n\n\n\n\n¿Podemos hacer algo mejor que elegir de acuerdo al PIB? ¿Cómo integramos el resto de las variables en un criterio de selección?\n\nAnálisis de grupos por k-medias\nLa agrupación (clustering) es una técnica de aprendizaje automático que nos ayuda descubrir patrones y estructuras ocultas en los datos. La técnica k-medias (k-means) agrupa conjuntos de casos similares (por ejemplo países) utilizando variables numéricas (también llamadas dimensiones). La agrupación se lleva a cabo a minimizando las distancias entre k grupos de casos (clústers), siendo k un número entero que conocemos de antemano o que podemos llegar a estimar (Fig. 2)\n\nFigura 2. Agrupación de casos en dos grupos (k = 2). Cada uno de los ejes corresponde a una variable numérica. La distancia media entre los puntos rojos y azules y el centro de cada clúster (puntos verdes) sirve para llevar a cabo la agrupación.\n\n\n\n",
    "preview": "blog_posts/2026-01-05-decisiones-difciles/decisiones-difciles_files/figure-html5/unnamed-chunk-1-1.png",
    "last_modified": "2026-01-06T13:25:24+01:00",
    "input_file": {}
  }
]
