[
  {
    "path": "blog_posts/2026-01-05-decisiones-difciles/",
    "title": "Decisiones Difíciles",
    "description": "Tenemos los medios, tenemos los fondos, ¿cómo decidimos a quién ayudar?",
    "author": [
      {
        "name": "Erick García-García, Ph.D.",
        "url": {}
      }
    ],
    "date": "2026-01-08",
    "categories": [],
    "contents": "\n\nContents\n¿Decisiones difíciles?\nPodríamos usar el PIB cómo único criterio de selección?\nAnálisis de agrupación por k-medias\nDistribución de las variables en los distintos k grupos\n¿Y si sólo usamos el PIB como criterio de selección?\n¿Además del PIB qué caracteriza a los países del k grupo 3?\nNuestra recomendación\nConclusión del análisis\n\n\n\n\n¿Decisiones difíciles?\nHELP International es una ONG humanitaria internacional que la lucha contra la pobreza y proporciona servicios básicos y socorro a la población de los países atrasados, especialmente frente a desastres naturales.\nHELP International recaudó alrededor de $10 millones USD y quiere utilizar ese dinero de forma estratégica para desarrollar campañas de ayuda en los países que más lo necesiten.\n\n¿Cómo decidimos qué países necesitan más ayuda? 🤔\n\nHELP International contaba con una tabla de datos sociodemográficos (descargar1) de 167 países candidatos con las siguientes variables:\nPaís.\nMortalidad infantil: muerte de niños menores de 5 años por cada 1.000 nacidos vivos.\nExportaciones: exportaciones de bienes y servicios per cápita.\nSalud: gasto total en salud per cápita.\nImportaciones: importaciones de bienes y servicios per cápita.\nIngresos: ingresos netos por persona.\nInflación: inflación en relación al crecimiento anual del PIB total.\nEsperanza de vida: promedio de años que viviría un niño recién nacido si los patrones actuales de mortalidad sigan siendo los mismos.\nTasa de fertilidad: número de hijos que nacería de cada mujer si las tasas actuales de fecundidad por edad siguen siendo las mismas.\nProducto interno bruto: calculado como el PIB total dividido por la población total.\nLa Tabla 1 muestra los 15 países con el PIB más bajo, y los valores de algunas de estas variables.\n\nTabla 1. Países con el PIB más bajo.PaísPIBIngresoGasto SaludEsp. vidaMort. InfantilBurundi23176411.6057.793.6Liberia32770011.8060.889.3Congo, Dem. Rep.3346097.9157.5116.0Niger3488145.1658.8123.0Sierra Leone3991,22013.1055.0160.0Madagascar4131,3903.7760.862.2Mozambique4199185.2154.5101.0Central African Republic4468883.9847.5149.0Malawi4591,0306.5953.190.5Eritrea4821,4202.6661.755.2Togo4881,2107.6558.790.3Guinea-Bissau5471,3908.5055.6114.0Afghanistan5531,6107.5856.290.2Gambia5621,6605.6965.580.3Rwanda5631,35010.5064.663.6\n\n\nUna primera aproximación, para ayudarnos a decidir, sería usar el PIB como un criterio de selección.\n\nPodríamos usar el PIB cómo único criterio de selección?\nCómo una primera aproximación para nuestra toma de decisión correlacionamos todas nuestras variables con el PIB.\n\n\n\nFigura1. Correlación del PIB (gdpp) con las otras variables socioeconómicas: health, gasto en salud; life_expec, esperanza de vida; child_mort, mortalidad infantil; total_fer, tasa de fertilidad; income, ingreso por habitante; inflation, inflación; imports, importaciones; exports, exportaciones. Cada punto representa un país.\nLa Figura 1 muestra que el PIB tiene diferentes grados de correlación con el resto de variables sociodemográficas, por lo que tal vez podría utilizarse como un criterio de selección, eligiendo simplemente los países con los valores de PIB más bajos.\n\n¿Podemos hacer algo mejor que elegir en función del PIB? ¿Es posible integrar el resto de las variables en un único criterio de selección? 🤔\n\nPara comenzar a responder a estas preguntas, buscamos patrones de agrupación en los países de acuerdo a sus características.\nSi correlacionamos la esperanza de vida y el gasto en salud y los graficamos junto con el PIB y el ingreso por habitante (Fig. 2) vemos que los países tienden a formar pequeñas agrupaciones.\n\n\n\nFigura 2. Correlación del gasto en salud (health) y la esperanza de vida (life_expec). Cada país está representado por un punto en la gráfica; su tamaño es directamente proporcional al PIB (gdpp) y su color se ajusta al nivel de ingresos por habitante (income).\nLo mismo ocurre si correlacionamos el gasto en salud y la mortalidad infantil y los graficamos junto con el PIB y el ingreso por habitante (Fig. 3).\n\n\n\nFigura 3. Correlación del gasto en salud (health) y la mortalidad infantil (child_mort). Cada país está representado por un punto en la gráfica; su tamaño es directamente proporcional al PIB (gdpp) y su color se ajusta al nivel de ingresos por habitante (income).\n\n¿Podemos explotar de alguna manera estos patrones de agrupación y obtener un criterio de selección? 🤔\n\nAnálisis de agrupación por k-medias\nLa agrupación (clustering) es una técnica de aprendizaje automático que nos ayuda descubrir patrones y estructuras ocultas entre nuestras variables.\nLa técnica k-medias (k-means) agrupa conjuntos de casos similares (por ejemplo países) utilizando variables numéricas (también llamadas dimensiones). La agrupación se lleva a cabo minimizando las distancias entre k grupos de casos (clusters) (Fig. 4), siendo k el número de agrupaciones que conocemos de antemano, o que debemos llegar a estimar.\n\nFigura 4. Agrupación de casos en dos grupos (k = 2). Cada uno de los ejes corresponde a una variable numérica. La distancia media entre los puntos rojos y azules (líneas de colores) y el centro de cada grupo (puntos verdes) sirve como una medida para llevar a cabo la agrupación.\nEl primer paso para llevar a cabo el análisis de agrupación por k-medias es la normalización de los datos, con el fin de que las diferencias en las escalas de medición de cada variable no generen sesgos en las relaciones entre las variables.\nLa Figura 5 muestra las medias y las desviaciones estándar de cada una de las variables antes (paneles superiores) y después (paneles inferiores) de la normalización.\n\n\n\nFigura 5. Medias y desviaciones estándar de cada variable, antes (paneles superiores) y después (paneles inferiores) de la normalización de los datos.\nComo no sabemos de antemano cuántos grupos hay dentro de nuestros datos, hacemos un análisis de agrupación por k-medias serializado en R2 usando los datos normalizados. Usamos valores de k de 1 a 15 (siendo k el número de agrupaciones esperado) y graficamos la suma total de las distancias entre grupos (total distance within groups) (Fig. 6): buscamos dentro del gráfico un valor de k en el que la distancia total entre grupos comience a tener un comportamiento asintótico.\n\n\n\nFigura 6. Análisis serializado de la distancia total entre grupos (total distance within groups).\nAunque la reducción de la distancia entre grupos es bastante paulatina, podríamos elegir k = 3 (es decir tres grupos) para continuar con el análisis y ver cómo se comportan los datos.\nCreamos el modelo de agrupación con 3 grupos. Una vez que tenemos los datos normalizados, el código en R para la generación de este modelo es bastante sencillo:\n\n\nset.seed(1976)\nk <- 3 # number chosen after inspecting the scree plot\nkm_3model <- kmeans(scaled_DF, # DF is a numeric sacled dada frame\n                     centers = k, # known  beforehand\n                     nstart = 20, # n. of runs to find a clustering solution\n                     iter.max = 50) # max. number of iterations\n\n\nLa Tabla 2 contiene una muestra aleatoria de 10 países y la afiliación de cada uno a un k grupo (Grupos 1 a 3).\n\nTabla 2. Muestra aleatoria de 10 países y su afiliación a cada uno de los k grupos.PaísGrupoPortugal1Estonia2Peru2Croatia2Mauritania3United States1United Arab Emirates1Italy1Serbia2Madagascar3\n\nDistribución de las variables en los distintos k grupos\nPara explorar la eficacia de la agrupación, realizamos un análisis de correlación dos a dos con cada una de las variables de nuestra tabla de datos, coloreando los puntos en función del k grupo al que pertenecen (Fig. 7).\n\n\n\nFigura 7. Análisis de correlación dos a dos con cada una de las variables de nuestra tabla de datos. Los colores corresponden a cada uno de los k grupos. Cada punto representa un país. Gdpp, PIB; health, gasto en salud; life_expec, esperanza de vida; child_mort, mortalidad infantil; total_fer, tasa de fertilidad; income, ingreso; inflation, inflación; imports, importaciones; exports, exportaciones.\nComo podemos ver en la Figura 7, muchas de las correlaciones entre variables muestran una clara separación de países en grupos, por ejemplo, esperanza de vida (life_expec) y mortalidad infantil (child_mort). Sin embargo, la distinción entre grupos de países no es tan clara para otras variables; como por ejemplo, importaciones (imports) y exportaciones (exports).\nA continuación, analizamos el valor del PIB para cada uno de los grupos. La Figura 8 muestra que el k grupo 3 es el que tiene el valor de PIB más bajo.\n\n\n\nFigura 8. Análisis del PIB (gdpp) por k grupo (cluster).\nA continuación analizamos la distribución de cada una de las variables en función de la afiliación de cada país a su k grupo (Figura 9).\n\n\n\nFigura 9. Distribución de cada una de las variables en función de la afiliación de los países a un k grupo (cluster). Health, gasto en salud; life_expec, esperanza de vida; child_mort, mortalidad infantil; total_fer, tasa de fertilidad; income, ingreso; inflation, inflación; imports, importaciones; exports, exportaciones.\nLa Figura 9 muestra que los países que pertenecen al k grupo 3 tienen los peores valores para casi todas las variables sociodemográficas; por ejemplo, gasto en salud, esperanza de vida, mortalidad infantil, e ingreso por habitante.\n\n🥳 El análisis de agrupación por k-medias nos ha permitido identificar claramente un grupo de países con las peores variables sociodemográficas. Pero… ¿podríamos haber usado simplemente los valores de PIB más bajos como filtro? 🤔\n\n¿Y si sólo usamos el PIB como criterio de selección?\nLa Figura 10 muestra la distribución de PIB de los 47 países que integran el k grupo 3 y de los 47 países con el PIB más bajo.\n\n\n\nFigura 10. Distribución del PIB (gdpp) de los países (country) del k grupo 3 y de los 47 países con el PIB más bajo.\nResulta evidente que hay una gran diferencia en la distribución del PIB en los países del k grupo 3 y los países con el PIB más bajo, ya que el k grupo 3 incluye países con altos valores de PIB.\nLa Tabla 3 muestra los países del k grupo 3 que no están en la lista de países con el PIB más bajo de la Figura 10 y los países con PIB más bajo que no pertenecen al k grupo 3; llamémosles países “divergentes”.\n\nTabla 3. Países DivergentesPaísGrupoAngolacluster 3Botswanacluster 3Congo, Rep.cluster 3Equatorial Guineacluster 3Gaboncluster 3Iraqcluster 3Namibiacluster 3Nigeriacluster 3South Africacluster 3Timor-Lestecluster 3Nepallow_gdppTajikistanlow_gdppBangladeshlow_gdppCambodialow_gdppKyrgyz Republiclow_gdppMyanmarlow_gdppSolomon Islandslow_gdppVietnamlow_gdppIndialow_gdppUzbekistanlow_gdppCluster 3, k grupo 3; low_gdpp, PIB bajo.\n\n\n¿Qué hace diferentes a los países “divergentes”? 🤔\n\n¿Además del PIB qué caracteriza a los países del k grupo 3?\nPara contestar a esta pregunta, podemos comparar la distribución de cada una de nuestras variables a través de gráficos de caja y bigotes (box plots, Figs. 11-12).\n\n\n\n\n\n\nFigura 11. Distribución de variables socio-económicas en países divergentes. Health, gasto en salud; life_expec, esperanza de vida; child_mort, mortalidad infantil; total_fer, tasa de fertilidad; group, grupo.\nLa Figura 11 muestra que, a pesar de que el gasto en salud es similar entre los países con PIB bajo y los del k grupo 3 (la mediana y el rango son similares), la esperanza de vida es menor en los países del k grupo 3 mientras que la mortalidad infantil y la tasa de fertilidad son mayores.\n\n\n\n\n\n\nFigura 12. Distribución de variables económicas en países divergentes. Gdpp, PIB; income, ingreso; inflation, inflación; imports, importaciones; exports, exportaciones; group, grupo.\nLa Figura 12 muestra que tanto el PIB como el ingreso por habitante son mayores en los países del k grupo 3 y que no existen diferencias tan acusadas en importaciones y exportaciones.\nLa Tabla 4 muestra los 10 países del k grupo 3 con los valores de PIB más altos; entre ellos vemos países como Iraq y Guinea Ecuatorial, cuya riqueza viene de la explotación petrolera aunque existen altos niveles de desigualdad socioeconómica.\n\nTabla 4. Países del k grupo 3 con el PIB más altoPaísPIBEquatorial Guinea17,100Gabon8,750South Africa7,280Botswana6,350Namibia5,190Iraq4,500Timor-Leste3,600Angola3,530Congo, Rep.2,740Nigeria2,330\n\n\n¿Cuál es nuestra recomendación para HELP International? 🤓\n\nNuestra recomendación\nNuestra recomendación a HELP International sería invertir los fondos recaudados en los países del k grupo 3, ya que éstos se caracterizan por tener altos niveles de mortalidad infantil y menor esperanza de vida, a pesar de que algunos de ellos tengan un PIB medio y un ingreso por habitante superior al de países con los valores de PIB más bajos.\nDisminuir la mortalidad infantil y aumentar la esperanza de vida son objetivos que van en la línea de lo que HELP International desea aportar a la sociedad.\nConclusión del análisis\n\n🔍 La técnica de agrupación por k-medias nos ha permitido integrar 9 variables en un único criterio de selección (afiliación al k grupo 3) para identificar a los 47 países más vulnerables.\n🏥 Las características que distinguen a los países del k grupo 3 de otros países con bajos niveles de PIB nos permiten afirmar que éstos podrían beneficiarse significativamente de programas sociales por HELP International, dirigidos especialmente al área de la salud.\n\n\nLa tabla de datos utilizada para este análisis fue descargada de Kaggle.↩︎\nEl análisis de este post ha sido realizado en su totalidad usando en lenguaje de programación R.↩︎\n",
    "preview": "blog_posts/2026-01-05-decisiones-difciles/decisiones-difciles_files/figure-html5/unnamed-chunk-1-1.png",
    "last_modified": "2026-01-08T10:18:15+01:00",
    "input_file": {}
  }
]
